import React from 'react';
import '../../css/Welcome.css'; // Ensure the path is correct
import learneez1 from './learneez1.jpg'; // Adjust the path based on your folder structure
import Footer from '../Components/Footer';
import FrontPageLayout from '@/Layouts/FrontPageLayout';
const About = () => {
    return (
        <FrontPageLayout>
        <div className="welcome-container">
  
            <main className="main-content">
                 
                
                <section className="about-section">
                       <h2>Шрифт за приложението</h2>
                    <p>
  
                     Шрифтът Adys е специално разработен за хора с <strong>дислексия</strong>, като улеснява четенето чрез оптимизирани форми на буквите. Той подобрява разпознаваемостта на знаците и минимизира зрителните затруднения.
                    Шрифтът съдържа българска форма на кирилица. В <strong>Learneez</strong> го използваме, за да осигурим достъпност и комфорт при четене за деца с дислексия. Този шрифт не затруднява четенето за хора, които нямат този проблем. <br />
                    Той е подходящ за създаване на обучителни материали за всякакви възрасти. А особено значение има за най-малките читатели.
                    Приложението има лиценз и разрешение за използване на шрифта, създаден от Кристина Костова.
                    </p>

                    <h2>За продукта</h2>
                    <p>
                    Нашето приложение е създадено, за да подкрепя малките ученици, като им осигурява необходимата помощ без постоянната намеса на родител. То значително намалява нуждата от индивидуално внимание и улеснява родителския контрол върху учебния процес на детето.<br/>
                    Децата с дислексия често срещат затруднения при четене и писане, което изисква от тях многократно повече усилия и води до бърза умора. Концентрацията им се изчерпва по-бързо, а нуждата от чести и продължителни почивки е по-голяма. Нашето приложение използва новите технологии, за да щади силите както на децата, така и на техните родители. Това освобождава време за любими занимания и прави ученето по-ефективно и приятно.
                    </p>
                </section>

                <section className="call-to-action">
                    <h2>Започнете сега</h2>
                    <p>Нужна е единствено регистрация</p>
                    <a href="/register" className="cta-button">Старт</a>
                </section>
            </main>
        </div>
        </FrontPageLayout>
    );
};

export default About;
